Table of Contents
 Class PointLoadOnLine
Namespace
IdeaRS.OpenModel.Loading
Assembly
IdeaRS.OpenModel.dll
Load in specific point on line
[OpenModelClass("CI.StructModel.Loading.PointLoadOnLine,CI.Loading", "CI.StructModel.Loading.IPointLoadOnLine,CI.BasicTypes")]
public class PointLoadOnLine : OpenElementId
Inheritance
object
OpenObject
OpenElementId
PointLoadOnLine
Inherited Members
 OpenElementId.Id
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Examples
This sample shows how to create a point load on the line.
//Creating the model
OpenModel openModel = new OpenModel();
//Create nodes
Point3D pointA = new Point3D();
pointA.X = 0;
pointA.Y = 0;
pointA.Z = 0;
openModel.AddObject(pointA);
Point3D pointB = new Point3D();
pointB.X = 0;
pointB.Y = 0;
pointB.Z = 1.2;
openModel.AddObject(pointB);
Point3D pointC = new Point3D();
pointC.X = 0;
pointC.Y = 0;
pointC.Z = 2.4;
openModel.AddObject(pointC);
//Line between nodes
LineSegment3D line1 = new LineSegment3D();
line1.StartPoint = new ReferenceElement(pointA);
line1.EndPoint = new ReferenceElement(pointB);
//LCS of line
line1.LocalCoordinateSystem = new CoordSystemByZup();
openModel.AddObject(line1);
//Line between nodes
LineSegment3D line2 = new LineSegment3D();
line2.StartPoint = new ReferenceElement(pointB);
line2.EndPoint = new ReferenceElement(pointC);
//LCS of line
line2.LocalCoordinateSystem = new CoordSystemByZup();
openModel.AddObject(line2);
//Load case
LoadCase loadCase = new LoadCase();
//...
openModel.AddObject(loadCase);
//Point loading impulse on the bottom of the "line1" - in the LCS of line
PointLoadOnLine pointLoadA = new PointLoadOnLine();
pointLoadA.Geometry = new ReferenceElement(line1);
pointLoadA.RelativePosition = 0.0;
pointLoadA.Fx = 10e3;
pointLoadA.Ez = 0.024;
openModel.AddObject(pointLoadA);
loadCase.PointLoadsOnLine.Add(new ReferenceElement(pointLoadA));
Constructors
 PointLoadOnLine()
Constructor
public PointLoadOnLine()
Properties
 Direction
Local / global
public LoadDirection Direction { get; set; }
Property Value
LoadDirection
 Ey
Eccentricity in Y direction
public double Ey { get; set; }
Property Value
double
 Ez
Eccentricity in Z direction
public double Ez { get; set; }
Property Value
double
 Fx
Force in X direction
public double Fx { get; set; }
Property Value
double
 Fy
Force in Y direction
public double Fy { get; set; }
Property Value
double
 Fz
Force in Z direction
public double Fz { get; set; }
Property Value
double
 Geometry
Segment3D or PolyLine3D
public ReferenceElement Geometry { get; set; }
Property Value
ReferenceElement
 Mx
Moment about the x-axis
public double Mx { get; set; }
Property Value
double
 My
Moment about the y-axis
public double My { get; set; }
Property Value
double
 Mz
Moment about the z-axis
public double Mz { get; set; }
Property Value
double
 RelativePosition
Relative position on geometry line
public double RelativePosition { get; set; }
Property Value
double
 Edit this page